apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_spi_mem_reg.h
#define SPI_MEM_PER_END_INT_ENA    (BIT(0))
#define SPI_MEM_PER_END_INT_ENA_M  (BIT(0))
#define SPI_MEM_PER_END_INT_ENA_V  0x1
#define SPI_MEM_PER_END_INT_ENA_S  0

#define SPI_MEM_INT_CLR_REG(i)          (REG_SPI_MEM_BASE(i) + 0xF4)

/* SPI_MEM_ECC_ERR_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The clear bit for SPI_MEM_ECC_ERR_INT interrupt.
 * SPI_MEM_ECC_ERR_ADDR and SPI_MEM_ECC_ERR_CNT will be cleared by the pulse
 * of this bit.
 */

#define SPI_MEM_ECC_ERR_INT_CLR    (BIT(4))
#define SPI_MEM_ECC_ERR_INT_CLR_M  (BIT(4))
#define SPI_MEM_ECC_ERR_INT_CLR_V  0x1
#define SPI_MEM_ECC_ERR_INT_CLR_S  4

/* SPI_MEM_BROWN_OUT_INT_CLR : WT ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The status bit for SPI_MEM_BROWN_OUT_INT interrupt. */

#define SPI_MEM_BROWN_OUT_INT_CLR    (BIT(3))
#define SPI_MEM_BROWN_OUT_INT_CLR_M  (BIT(3))
#define SPI_MEM_BROWN_OUT_INT_CLR_V  0x1
#define SPI_MEM_BROWN_OUT_INT_CLR_S  3

/* SPI_MEM_TOTAL_TRANS_END_INT_CLR : WT ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The clear bit for SPI_MEM_TOTAL_TRANS_END_INT interrupt. */

#define SPI_MEM_TOTAL_TRANS_END_INT_CLR    (BIT(2))
#define SPI_MEM_TOTAL_TRANS_END_INT_CLR_M  (BIT(2))
#define SPI_MEM_TOTAL_TRANS_END_INT_CLR_V  0x1
#define SPI_MEM_TOTAL_TRANS_END_INT_CLR_S  2

/* SPI_MEM_PES_END_INT_CLR : WT ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The clear bit for SPI_MEM_PES_END_INT interrupt. */

#define SPI_MEM_PES_END_INT_CLR    (BIT(1))
#define SPI_MEM_PES_END_INT_CLR_M  (BIT(1))
#define SPI_MEM_PES_END_INT_CLR_V  0x1
#define SPI_MEM_PES_END_INT_CLR_S  1

/* SPI_MEM_PER_END_INT_CLR : WT ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The clear bit for SPI_MEM_PER_END_INT interrupt. */

#define SPI_MEM_PER_END_INT_CLR    (BIT(0))
#define SPI_MEM_PER_END_INT_CLR_M  (BIT(0))
#define SPI_MEM_PER_END_INT_CLR_V  0x1
#define SPI_MEM_PER_END_INT_CLR_S  0

#define SPI_MEM_INT_RAW_REG(i)          (REG_SPI_MEM_BASE(i) + 0xF8)

/* SPI_MEM_ECC_ERR_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The raw bit for SPI_MEM_ECC_ERR_INT interrupt. When
 * APB_CTRL_FECC_ERR_INT_EN is set and  APB_CTRL_SECC_ERR_INT_EN is cleared,
 * this bit is triggered when the error times of SPI0/1 ECC read flash are
 * equal or bigger than APB_CTRL_ECC_ERR_INT_NUM.
 * When APB_CTRL_FECC_ERR_INT_EN is cleared and  APB_CTRL_SECC_ERR_INT_EN
 * is set, this bit is triggered when the error times of SPI0/1 ECC read
 * external RAM are equal or bigger than
 * APB_CTRL_ECC_ERR_INT_NUM. When APB_CTRL_FECC_ERR_INT_EN and
 * APB_CTRL_SECC_ERR_INT_EN are set, this bit is triggered when the total
 * error times of SPI0/1 ECC read external RAM and flash are equal or bigger
 * than APB_CTRL_ECC_ERR_INT_NUM. When APB_CTRL_FECC_ERR_INT_EN and
 * APB_CTRL_SECC_ERR_INT_EN are cleared, this bit will not be triggered.
 */

#define SPI_MEM_ECC_ERR_INT_RAW    (BIT(4))
#define SPI_MEM_ECC_ERR_INT_RAW_M  (BIT(4))
#define SPI_MEM_ECC_ERR_INT_RAW_V  0x1
#define SPI_MEM_ECC_ERR_INT_RAW_S  4

/* SPI_MEM_BROWN_OUT_INT_RAW : R/WTC/SS ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The raw bit for SPI_MEM_BROWN_OUT_INT interrupt.
 * 1: Triggered condition is that chip is loosing power and RTC module sends
 * out brown out close flash request to SPI1. After SPI1 sends out suspend
 * command to flash, this interrupt is triggered and MSPI returns to idle
 * state.
 * 0: Others.
 */

#define SPI_MEM_BROWN_OUT_INT_RAW    (BIT(3))
#define SPI_MEM_BROWN_OUT_INT_RAW_M  (BIT(3))
#define SPI_MEM_BROWN_OUT_INT_RAW_V  0x1
#define SPI_MEM_BROWN_OUT_INT_RAW_S  3

/* SPI_MEM_TOTAL_TRANS_END_INT_RAW : R/WTC/SS ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The raw bit for SPI_MEM_TOTAL_TRANS_END_INT interrupt.
 * 1: Triggered when SPI1 transfer is done and flash is already idle. When
 * WRSR/PP/SE/BE/CE is sent and PES/PER command is sent, this bit is set when
 * WRSR/PP/SE/BE/CE is success.
 * 0: Others.
 */

#define SPI_MEM_TOTAL_TRANS_END_INT_RAW    (BIT(2))
#define SPI_MEM_TOTAL_TRANS_END_INT_RAW_M  (BIT(2))
#define SPI_MEM_TOTAL_TRANS_END_INT_RAW_V  0x1
#define SPI_MEM_TOTAL_TRANS_END_INT_RAW_S  2

/* SPI_MEM_PES_END_INT_RAW : R/WTC/SS ;bitpos:[1] ;default: 1'b0 ; */

/* Description: The raw bit for SPI_MEM_PES_END_INT interrupt.
 * 1: Triggered when Auto Suspend command (0x75) is sent and flash is
 * suspended successfully.
 * 0: Others.
 */

#define SPI_MEM_PES_END_INT_RAW    (BIT(1))
#define SPI_MEM_PES_END_INT_RAW_M  (BIT(1))
#define SPI_MEM_PES_END_INT_RAW_V  0x1
#define SPI_MEM_PES_END_INT_RAW_S  1

/* SPI_MEM_PER_END_INT_RAW : R/WTC/SS ;bitpos:[0] ;default: 1'b0 ; */

/* Description: The raw bit for SPI_MEM_PER_END_INT interrupt.
 * 1: Triggered when Auto Resume command (0x7A) is sent and flash is
 *    resumed successfully.
 * 0: Others.
 */

#define SPI_MEM_PER_END_INT_RAW    (BIT(0))
#define SPI_MEM_PER_END_INT_RAW_M  (BIT(0))
#define SPI_MEM_PER_END_INT_RAW_V  0x1
#define SPI_MEM_PER_END_INT_RAW_S  0

#define SPI_MEM_INT_ST_REG(i)          (REG_SPI_MEM_BASE(i) + 0xFC)

/* SPI_MEM_ECC_ERR_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */

/* Description: The status bit for SPI_MEM_ECC_ERR_INT interrupt. */

#define SPI_MEM_ECC_ERR_INT_ST    (BIT(4))
#define SPI_MEM_ECC_ERR_INT_ST_M  (BIT(4))
#define SPI_MEM_ECC_ERR_INT_ST_V  0x1
#define SPI_MEM_ECC_ERR_INT_ST_S  4

/* SPI_MEM_BROWN_OUT_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */

/* Description: The status bit for SPI_MEM_BROWN_OUT_INT interrupt. */

#define SPI_MEM_BROWN_OUT_INT_ST    (BIT(3))
#define SPI_MEM_BROWN_OUT_INT_ST_M  (BIT(3))
#define SPI_MEM_BROWN_OUT_INT_ST_V  0x1
#define SPI_MEM_BROWN_OUT_INT_ST_S  3

/* SPI_MEM_TOTAL_TRANS_END_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */

/* Description: The status bit for SPI_MEM_TOTAL_TRANS_END_INT interrupt. */

#define SPI_MEM_TOTAL_TRANS_END_INT_ST    (BIT(2))
#define SPI_MEM_TOTAL_TRANS_END_INT_ST_M  (BIT(2))
#define SPI_MEM_TOTAL_TRANS_END_INT_ST_V  0x1
#define SPI_MEM_TOTAL_TRANS_END_INT_ST_S  2

/* SPI_MEM_PES_END_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */

